src/cf/Documents/ОбесценениеЗапасов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ОбесценениеЗапасов</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Запасы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/Enums/ВидыРегламентныхОпераций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыРегламентныхОпераций</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НачислениеЗарплаты</Name>
					<Comment>1</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачислениеВзносовОтНесчастыхСлучаев</Name>
					<Comment>1</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачислениеРезервовПоОплатеТруда</Name>
					<Comment>1</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачислениеНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АмортизацияИИзносОС</Name>
					<Comment>1</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПризнаниеВНУАрендныхПлатежей</Name>
					<Comment>1</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АмортизацияНМАИсписаниеРасходовПоНИОКР</Name>
					<Comment>1</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПогашениеСтоимостиСпецодеждыИспецоснасткиВэксплуатации</Name>
					<Comment>1</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасходМатериаловДляВыпускаПродукции</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачислениеПроцентныхРасходов</Name>
					<Comment>1</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереоценкаВалютныхСредств</Name>
					<Comment>1</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КорректировкаСтоимостиНоменклатуры</Name>
					<Comment>1</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗакрытиеСчета97</Name>
					<Comment>1</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетТорговойНаценкиПоПроданнымТоварам</Name>
					<Comment>1</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетНалогаНаИмущество</Name>
					<Comment>1</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетТранспортногоНалога</Name>
					<Comment>1</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетЗемельногоНалога</Name>
					<Comment>1</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетТорговогоСбора</Name>
					<Comment>1</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПризнаниеРасходовНаПриобретениеОСДляУСН</Name>
					<Comment>1</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПризнаниеРасходовНаПриобретениеНМАДляУСН</Name>
					<Comment>1</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсключениеНЗПИзСоставаМатериальныхРасходовДляУСН</Name>
					<Comment>1</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеДопРасходовДляУСН</Name>
					<Comment>1</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеТаможенныхПлатежейДляУСН</Name>
					<Comment>1</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетДолейСписанияКосвенныхРасходов</Name>
					<Comment>2</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗачетАвансаПоЕдиномуНалоговомуСчету</Name>
					<Comment>2</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗакрытиеСчетов20_23_25_26</Name>
					<Comment>3</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗакрытиеСчета44</Name>
					<Comment>3</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетРезервовПоСомнительнымДолгам</Name>
					<Comment>3</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВключениеАвансовВПрочиеДоходыДляИП</Name>
					<Comment>3</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РаспределениеРасходовПоВидамДеятельностиДляУСН</Name>
					<Comment>3</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РаспределениеРасходовПоВидамДеятельностиДляИП</Name>
					<Comment>3</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачислениеСтраховыхВзносовИП</Name>
					<Comment>3</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетРасходовУменьшающихОтдельныеНалоги</Name>
					<Comment>3</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбесценениеЗапасов</Name>
					<Comment>3</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗакрытиеСчетов90_91</Name>
					<Comment>4</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереносУбытковПоНалогуНаПрибыль</Name>
					<Comment>4</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетНалогаНаПрибыль</Name>
					<Comment>4</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетОтложенногоНалога</Name>
					<Comment>4</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетНалогаУСН</Name>
					<Comment>4</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачислениеНалогаАУСН</Name>
					<Comment>4</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетЕНВД</Name>
					<Comment>4</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетНДФЛДляИП</Name>
					<Comment>4</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачислениеНалогаНаПрофессиональныйДоход</Name>
					<Comment>4</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РеформацияБаланса</Name>
					<Comment>4</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереводОСВМалоценноеОборудование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереходНаФСБУ25</Name>
					<Comment>5</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереходНаФСБУ6</Name>
					<Comment>5</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереходНаФСБУ14</Name>
					<Comment>5</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачислениеНалоговНаЕНС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КорректировкаОтложенногоНалога</Name>
					<Comment>6</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Documents/ОбесценениеЗапасов/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ЗаполнениеДокументов.Заполнить(ЭтотОбъект, ДанныеЗаполнения);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Дата = НачалоДня(ОбщегоНазначения.ТекущаяДатаПользователя());
	Ответственный = Пользователи.ТекущийПользователь();
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ПометкаУдаления И Не УчетнаяПолитика.ОбесценениеЗапасов(Организация, Дата) Тогда
		ОбщегоНазначения.СообщитьПользователю(
			НСтр("ru = 'Учет обесценения запасов отключен в учетной политике'"),
			Ссылка,
			"Дата", // Отправляем в то поле, который не скрывается функциональностью
			"Дата",
			Отказ);
	КонецЕсли;
	
	ПроверитьДокументЗаЭтуДатуЕдинственный(Отказ, РежимЗаписи);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	РаботаСПоследовательностями.ЗарегистрироватьУстареваниеОперации(
		ЭтотОбъект,
		Перечисления.ВидыРегламентныхОпераций.ОбесценениеЗапасов);
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	РаботаСПоследовательностями.ЗарегистрироватьУстареваниеОперации(
		ЭтотОбъект,
		Перечисления.ВидыРегламентныхОпераций.ОбесценениеЗапасов);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПроверитьДокументЗаЭтуДатуЕдинственный(Отказ, РежимЗаписи)

	Если РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Проведен И РежимЗаписи <> РежимЗаписиДокумента.Проведение Тогда
		Возврат;
	КонецЕсли;
	
	Диапазон = Новый Диапазон(НачалоДня(Дата), КонецДня(Дата));
	
	БлокировкаДанных = Новый БлокировкаДанных;
	ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("Документ.ОбесценениеЗапасов");
	ЭлементБлокировкиДанных.УстановитьЗначение("Дата", Диапазон);
	
	БлокировкаДанных.Заблокировать();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка",        Ссылка);
	Запрос.УстановитьПараметр("Организация",   Организация);
	Запрос.УстановитьПараметр("НачалоПериода", Диапазон.Начало);
	Запрос.УстановитьПараметр("КонецПериода",  Диапазон.Конец);
	
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ОбесценениеЗапасов.Ссылка КАК Ссылка,
	|	ОбесценениеЗапасов.Дата КАК Дата
	|ИЗ
	|	Документ.ОбесценениеЗапасов КАК ОбесценениеЗапасов
	|ГДЕ
	|	ОбесценениеЗапасов.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ОбесценениеЗапасов.Проведен
	|	И ОбесценениеЗапасов.Организация = &Организация
	|	И ОбесценениеЗапасов.Ссылка <> &Ссылка";
		
	Если Запрос.Выполнить().Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Сообщение = СтрШаблон(
		НСтр("ru = 'На %1 уже введен перечень товаров, имеющих признаки обесценения'"),
		Формат(Дата, "ДЛФ=D"));
		
	ОбщегоНазначения.СообщитьПользователю(
		Сообщение,
		Ссылка,
		"Дата",
		"Дата",
		Отказ);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
